Revit 2027 API
AnnotationFamilyUtils Methods
The AnnotationFamilyUtils type exposes the following members.
Methods
Name | Description
HasExcludeFromLeaderOutline |  Checks if the element supports the EXCLUDE_FROM_LEADER_OUTLINE parameter.
HasLeaderSnapReference |  Checks if the element supports the LEADER_SNAP_REFERENCE parameter.
IsExcludedFromLeaderOutline |  Checks if the element is excluded from the annotation outline used by leaders.
IsLeaderSnapReference |  Checks if the element is a leader snap reference for annotation leader snapping.
SetIsExcludedFromLeaderOutline |  Sets if the element is excluded from the annotation outline used by leaders.
SetIsLeaderSnapReference |  Sets if the element is a leader snap reference for annotation leader snapping.
Top
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace